saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/GigaDevice.GD32F4xx_DFP.1.0.4.pdsc
        <!-- *************************  Device 'GD32F403RI'  ***************************** -->
        <device Dname="GD32F403RI">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define="GD32F403"/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>

        <!-- *************************  Device 'GD32F403RK'  ***************************** -->
        <device Dname="GD32F403RK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define="GD32F403"/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>

        <!-- *************************  Device 'GD32F403VC'  ***************************** -->
        <device Dname="GD32F403VC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x0C000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define="GD32F403"/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>

        <!-- *************************  Device 'GD32F403VE'  ***************************** -->
        <device Dname="GD32F403VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define="GD32F403"/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>

        <!-- *************************  Device 'GD32F403VG'  ***************************** -->
        <device Dname="GD32F403VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define=" GD32F403 "/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>

        <!-- *************************  Device 'GD32F403VI'  ***************************** -->
        <device Dname="GD32F403VI">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define=" GD32F403 "/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>

        <!-- *************************  Device 'GD32F403VK'  ***************************** -->
        <device Dname="GD32F403VK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define=" GD32F403"/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>

        <!-- *************************  Device 'GD32F403ZC'  ***************************** -->
        <device Dname="GD32F403ZC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x0C000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define="GD32F403"/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>

        <!-- *************************  Device 'GD32F403ZE'  ***************************** -->
        <device Dname="GD32F403ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define="GD32F403"/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>

        <!-- *************************  Device 'GD32F403ZG'  ***************************** -->
        <device Dname="GD32F403ZG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define="GD32F403"/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>

        <!-- *************************  Device 'GD32F403ZI'  ***************************** -->
        <device Dname="GD32F403ZI">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define="GD32F403"/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>

        <!-- *************************  Device 'GD32F403ZK'  ***************************** -->
        <device Dname="GD32F403ZK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F403.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/F403/Include/gd32f403.h" define="GD32F403"/>
          <debug svd="SVD/GD32F403.svd"/>
        </device>
      </subFamily>
  

<!-- ************************  Subfamily 'GD32F405'  **************************** -->
      <subFamily DsubFamily="GD32F405">
        <processor Dclock="200000000"/>
         <compile header="Device/F4XX/Include/gd32f4xx.h" define="GD32F405"/>
        <debug svd="SVD/GD32F4xx.svd"/>
        <description>
        GD32F405 - ARM Cortex-M4 Core
          Frequency up to 200 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 512KB to 3072 KB
          SRAM size is 192 KB with HW parity checking
          30KB ISP loader ROM
        </description>

        <!-- *************************  Device 'GD32F405RE'  ***************************** -->
        <device Dname="GD32F405RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_512KB.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F405RG'  ***************************** -->
        <device Dname="GD32F405RG">
          <memory    id="IROM1"                   start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_1MB.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      
