saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/GigaDevice.GD32F4xx_DFP.1.0.4.pdsc
        <!-- *************************  Device 'GD32F407VG'  ***************************** -->
        <device Dname="GD32F407VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_1MB.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F407VK'  ***************************** -->
        <device Dname="GD32F407VK">
          <memory    id="IROM1"                   start="0x08000000" size="0x300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_3MB.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

      <!-- *************************  Device 'GD32F407ZE'  ***************************** -->
        <device Dname="GD32F407ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_512KB.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F407ZG'  ***************************** -->
        <device Dname="GD32F407ZG">
          <memory    id="IROM1"                   start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_1MB.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F407ZK'  ***************************** -->
        <device Dname="GD32F407ZK">
          <memory    id="IROM1"                   start="0x08000000" size="0x300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_3MB.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F407IE'  ***************************** -->
        <device Dname="GD32F407IE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_512KB.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F407IG'  ***************************** -->
        <device Dname="GD32F407IG">
          <memory    id="IROM1"                   start="0x08000000" size="0x100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_1MB.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F407IK'  ***************************** -->
        <device Dname="GD32F407IK">
          <memory    id="IROM1"                   start="0x08000000" size="0x300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_3MB.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'GD32F450'  **************************** -->
      <subFamily DsubFamily="GD32F450">
        <processor Dclock="200000000"/>
         <compile header="Device/F4XX/Include/gd32f4xx.h" define="GD32F450"/>
        <debug svd="SVD/GD32F4xx.svd"/>
        <description>
        GD32F450 - ARM Cortex-M4 Core
          Frequency up to 200 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 512KB to 3072 KB
          SRAM size is 256 KB with HW parity checking
          30KB ISP loader ROM
        </description>

        <feature type="ETH"                n="1"              m="100000000"  name="Integrated Ethernet MAC with PHY"/>

        <!-- *************************  Device 'GD32F450VE'  ***************************** -->
        <device Dname="GD32F450VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x030000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_512KB.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F450VG'  ***************************** -->
        <device Dname="GD32F450VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x030000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_1MB.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>

