saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/GigaDevice.GD32F4xx_DFP.1.0.4.pdsc
        <!-- *************************  Device 'GD32F450VI'  ***************************** -->
        <device Dname="GD32F450VI">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x070000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_2MB.FLM" start="0x08000000" size="0x0200000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F450VK'  ***************************** -->
        <device Dname="GD32F450VK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x030000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_3MB.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F450ZE'  ***************************** -->
        <device Dname="GD32F450ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x030000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_512KB.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F450ZG'  ***************************** -->
        <device Dname="GD32F450ZG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x030000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_1MB.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F450ZI'  ***************************** -->
        <device Dname="GD32F450ZI">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x070000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_2MB.FLM" start="0x08000000" size="0x0200000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F450ZK'  ***************************** -->
        <device Dname="GD32F450ZK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x030000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_3MB.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F450IG'  ***************************** -->
        <device Dname="GD32F450IG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x030000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_1MB.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>

       <!-- *************************  Device 'GD32F450II'  ***************************** -->
        <device Dname="GD32F450II">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x070000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_2MB.FLM" start="0x08000000" size="0x0200000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F450IK'  ***************************** -->
        <device Dname="GD32F450IK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x030000" init   ="0" default="1"/>
          <memory    id="IRAM2"                   start="0x10000000" size="0x010000" init   ="0" default="0"/>
          <algorithm name="Flash/GD32F4xx_3MB.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

   <!-- Device Conditions -->
    <condition id="GD32F403">
      <description>GigaDevice GD32F403xx Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F403*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="GD32F403 CMSIS">
      <description>GigaDevice GD32F403 Devices and CMSIS-CORE</description>
      <require condition="GD32F403"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Libopt" />    
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="RCU"/>           
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="PMU"/>     
    </condition>

    <!-- GD32F403 STDPERIPHERALS RCU Conditions -->
    <condition id="GD32F403 403_STDPERIPHERALS RCU">
      <description>GigaDevice  GD32F403 Standard Peripherals Drivers with RCU</description>
      <require condition="GD32F403 CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="RCU"/>
    </condition>

     <!-- GD32F403 STDPERIPHERALS MISC Conditions -->
    <condition id="GD32F403 403_STDPERIPHERALS MISC">
      <description>GigaDevice  GD32F403 Standard Peripherals Drivers with MISC</description>
      <require condition="GD32F403 CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32F403 STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32F403 STDPERIPHERALS EVAL">
      <description>GigaDevice  GD32F403 Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32F403 CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="USART"/>
    </condition>

   <!-- Device Conditions -->
    <condition id="GD32F405">
      <description>GigaDevice GD32F405 Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F405*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32F407">
      <description>GigaDevice GD32F407 Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F407*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32F450">
      <description>GigaDevice GD32F450 Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F450*"/>
      <require Cclass="Device" Cgroup="Startup" />
      
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="GD32F4xx CMSIS">
      <description>GigaDevice GD32F4xx Devices and CMSIS-CORE</description>
      <accept condition="GD32F405"/>
      <accept condition="GD32F407"/>
      <accept condition="GD32F450"/>
      <accept  Cclass="Device" Cgroup="Libopt"  />
      <require Cclass="CMSIS" Cgroup="CORE"/>   
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="RCU"/>    
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="PMU"/>        
    </condition>

    <!-- GD32F4xx STDPERIPHERALS RCU Conditions -->
    <condition id="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>GigaDevice  GD32F4xx Standard Peripherals Drivers with RCU</description>
      <require condition="GD32F4xx CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="RCU"/>
    </condition>

     <!-- GD32F4xx STDPERIPHERALS MISC Conditions -->
    <condition id="GD32F4xx 4XX_STDPERIPHERALS MISC">
      <description>GigaDevice  GD32F4xx Standard Peripherals Drivers with MISC</description>
      <require condition="GD32F4xx CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32F4xx STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32F4xx STDPERIPHERALS EVAL">
      <description>GigaDevice  GD32F4xx Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32F4xx CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="USART"/>
      <require Cclass="Device" Cgroup="StdPeripherals" Csub="SYSCFG"/>
    </condition>
