saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/GigaDevice.GD32F4xx_DFP.1.0.4.pdsc
  <component Cclass="Device" Cgroup="StdPeripherals" Csub="TLI" Cversion="1.0.3" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>TFT-LCD interface(TLI) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TLI
        </RTE_Components_h>
        <files>
          <!-- TLI flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_tli.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_tli.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="TRNG" Cversion="1.0.3" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>True random number generator (TRNG) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TRNG
        </RTE_Components_h>
        <files>
          <!-- TRNG flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_trng.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_trng.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="USART" Cversion="1.0.3" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_usart.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_usart.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="WWDGT" Cversion="1.0.3" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_wwdgt.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_wwdgt.c" attr="config" version="1.0.3" />
        </files>
    </component>

    <!-- Utilities GD32F4xx -->

   <component Cclass="Device" Cgroup="EVAL" Csub="GD32F450I" Cversion="1.0.3" condition="GD32F4xx STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/F4XX/Utilities/gd32f450i_eval.h"/>
        <!-- eval file -->
        <file category="source" name="Device/F4XX/Utilities/gd32f450i_eval.c" attr="config" version="1.0.3"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F450Z" Cversion="1.0.3" condition="GD32F4xx STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/F4XX/Utilities/gd32f450z_eval.h"/>
        <!-- eval file -->
        <file category="source" name="Device/F4XX/Utilities/gd32f450z_eval.c" attr="config" version="1.0.3"/>
      </files>
    </component>

    <!-- Config GD32F4xx -->
    <component Cclass="Device" Cgroup="Libopt"  Cversion="1.0.3" condition="GD32F4xx CMSIS">
      <description> GD32F405/407/450 Series Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/F4XX/Include/gd32f4xx_libopt.h"/>
      </files>
    </component>


   <!-- Startup GD32F405 -->
    <component Cclass="Device" Cgroup="Startup"  Cversion="1.0.3" condition="GD32F405">
      <description>System Startup for GigaDevice GD32F405 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/F4XX/Include/"/>
        <file category="header" name="Device/F4XX/Include/gd32f4xx.h"/>
        <!-- startup file -->
        <file category="source" name="Device/F4XX/Source/ARM/startup_gd32f405.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/F4XX/Source/system_gd32f4xx.c"      attr="config" version="1.0.3"/>
      </files>
    </component>

   <!-- Startup GD32F407 -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="1.0.3" condition="GD32F407">
      <description>System Startup for GigaDevice GD32F407 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/F4XX/Include/"/>
        <file category="header" name="Device/F4XX/Include/gd32f4xx.h"/>
        <!-- startup file -->
        <file category="source" name="Device/F4XX/Source/ARM/startup_gd32f407.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/F4XX/Source/system_gd32f4xx.c"      attr="config" version="1.0.3"/>

      </files>
    </component>

   <!-- Startup GD32F450 -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="1.0.3" condition="GD32F450">
      <description>System Startup for GigaDevice GD32F450 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/F4XX/Include/"/>
        <file category="header" name="Device/F4XX/Include/gd32f4xx.h"/>
        <!-- startup file -->
        <file category="source" name="Device/F4XX/Source/ARM/startup_gd32f450.s" attr="config" version="1.0.3" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/F4XX/Source/system_gd32f4xx.c"      attr="config" version="1.0.3"/>
      </files>
    </component>
 
    <!-- GD32F403_StdPeripherals -->
    <component Cclass="Device" Cgroup="StdPeripherals" Csub="ADC" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_adc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_adc.c" attr="config" version="1.0.3" />
        </files>
    </component>

   <component Cclass="Device" Cgroup="StdPeripherals" Csub="BKP" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Backup register (BKP) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BKP
        </RTE_Components_h>
        <files>
          <!-- BKP flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_bkp.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_bkp.c" attr="config" version="1.0.3" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeripherals" Csub="CAN" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_can.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_can.c" attr="config" version="1.0.3" />
        </files>
    </component>

