saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/GigaDevice.GD32F4xx_DFP.1.0.4.pdsc
  <component Cclass="Device" Cgroup="StdPeripherals" Csub="CRC" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_crc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_crc.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="CTC" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Clock trim controller (CTC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CTC
        </RTE_Components_h>
        <files>
          <!-- CTC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_ctc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_ctc.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="DAC" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Digital-to-analog converter (DAC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_dac.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_dac.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="DBG" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- DBG flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_dbg.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_dbg.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="DMA" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_dma.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_dma.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="EXMC" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>External memory controller(EXMC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXMC
        </RTE_Components_h>
        <files>
          <!-- EXMC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_exmc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_exmc.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="EXTI" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_exti.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_exti.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="FMC" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_fmc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_fmc.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="FWDGT" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_fwdgt.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_fwdgt.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="GPIO" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_gpio.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_gpio.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="I2C" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_i2c.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_i2c.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="MISC" Cversion="1.0.3" condition="GD32F403 CMSIS">
      <description>MISC driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_misc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_misc.c" attr="config" version="1.0.3" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="PMU" Cversion="1.0.3" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_pmu.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_pmu.c" attr="config" version="1.0.3" />
        </files>
    </component>

